OS-Q/A21B/STM32F1/boards.txt
genericSTM32F103Z.menu.device_variant.STM32F103ZD=STM32F103ZD
genericSTM32F103Z.menu.device_variant.STM32F103ZD.build.cpu_flags=-DMCU_STM32F103ZD
genericSTM32F103Z.menu.device_variant.STM32F103ZD.upload.maximum_size=393216
genericSTM32F103Z.menu.device_variant.STM32F103ZD.upload.maximum_data_size=65536
genericSTM32F103Z.menu.device_variant.STM32F103ZD.build.ldscript=ld/stm32f103zd.ld

genericSTM32F103Z.menu.device_variant.STM32F103ZE=STM32F103ZE
genericSTM32F103Z.menu.device_variant.STM32F103ZE.build.cpu_flags=-DMCU_STM32F103ZE
genericSTM32F103Z.menu.device_variant.STM32F103ZE.upload.maximum_size=524288
genericSTM32F103Z.menu.device_variant.STM32F103ZE.upload.maximum_data_size=65536
genericSTM32F103Z.menu.device_variant.STM32F103ZE.build.ldscript=ld/stm32f103ze.ld

#---------------------------- UPLOAD METHODS ---------------------------

genericSTM32F103Z.menu.upload_method.DFUUploadMethod=STM32duino bootloader
genericSTM32F103Z.menu.upload_method.DFUUploadMethod.upload.protocol=maple_dfu
genericSTM32F103Z.menu.upload_method.DFUUploadMethod.upload.tool=maple_upload
genericSTM32F103Z.menu.upload_method.DFUUploadMethod.build.upload_flags=-DSERIAL_USB -DGENERIC_BOOTLOADER
genericSTM32F103Z.menu.upload_method.DFUUploadMethod.build.vect=VECT_TAB_ADDR=0x8002000
genericSTM32F103Z.menu.upload_method.DFUUploadMethod.build.ldscript=ld/stm32f103z_dfu.ld
genericSTM32F103Z.menu.upload_method.DFUUploadMethod.upload.usbID=1EAF:0003
genericSTM32F103Z.menu.upload_method.DFUUploadMethod.upload.altID=2

genericSTM32F103Z.menu.upload_method.serialMethod=Serial
genericSTM32F103Z.menu.upload_method.serialMethod.upload.protocol=maple_serial
genericSTM32F103Z.menu.upload_method.serialMethod.upload.tool=serial_upload
genericSTM32F103Z.menu.upload_method.serialMethod.build.upload_flags=-DCONFIG_MAPLE_MINI_NO_DISABLE_DEBUG=1

genericSTM32F103Z.menu.upload_method.STLinkMethod=STLink
genericSTM32F103Z.menu.upload_method.STLinkMethod.upload.protocol=STLink
genericSTM32F103Z.menu.upload_method.STLinkMethod.upload.tool=stlink_upload
genericSTM32F103Z.menu.upload_method.STLinkMethod.build.upload_flags=-DCONFIG_MAPLE_MINI_NO_DISABLE_DEBUG=1 -DSERIAL_USB -DGENERIC_BOOTLOADER

genericSTM32F103Z.menu.upload_method.BMPMethod=BMP (Black Magic Probe)
genericSTM32F103Z.menu.upload_method.BMPMethod.upload.protocol=gdb_bmp
genericSTM32F103Z.menu.upload_method.BMPMethod.upload.tool=bmp_upload
genericSTM32F103Z.menu.upload_method.BMPMethod.build.upload_flags=-DCONFIG_MAPLE_MINI_NO_DISABLE_DEBUG

#-- CPU Clock frequency
genericSTM32F103Z.menu.cpu_speed.speed_72mhz=72Mhz (Normal)
genericSTM32F103Z.menu.cpu_speed.speed_72mhz.build.f_cpu=72000000L

genericSTM32F103Z.menu.cpu_speed.speed_48mhz=48Mhz (Slow - with USB)
genericSTM32F103Z.menu.cpu_speed.speed_48mhz.build.f_cpu=48000000L

genericSTM32F103Z.menu.cpu_speed.speed_128mhz=Overclocked 128Mhz NO USB SERIAL. MANUAL RESET NEEDED TO UPLOAD
genericSTM32F103Z.menu.cpu_speed.speed_128mhz.build.f_cpu=128000000L

#-- Optimizations
genericSTM32F103Z.menu.opt.osstd=Smallest (default)
#genericSTM32F103Z.menu.opt.oslto=Smallest Code with LTO
#genericSTM32F103Z.menu.opt.oslto.build.flags.optimize=-Os -flto
#genericSTM32F103Z.menu.opt.oslto.build.flags.ldspecs=-flto
genericSTM32F103Z.menu.opt.o1std=Fast (-O1)
genericSTM32F103Z.menu.opt.o1std.build.flags.optimize=-O1
genericSTM32F103Z.menu.opt.o1std.build.flags.ldspecs=
#genericSTM32F103Z.menu.opt.o1lto=Fast (-O1) with LTO
#genericSTM32F103Z.menu.opt.o1lto.build.flags.optimize=-O1 -flto
#genericSTM32F103Z.menu.opt.o1lto.build.flags.ldspecs=-flto
genericSTM32F103Z.menu.opt.o2std=Faster (-O2)
genericSTM32F103Z.menu.opt.o2std.build.flags.optimize=-O2
genericSTM32F103Z.menu.opt.o2std.build.flags.ldspecs=
#genericSTM32F103Z.menu.opt.o2lto=Faster (-O2) with LTO
#genericSTM32F103Z.menu.opt.o2lto.build.flags.optimize=-O2 -flto
#genericSTM32F103Z.menu.opt.o2lto.build.flags.ldspecs=-flto
genericSTM32F103Z.menu.opt.o3std=Fastest (-O3)
genericSTM32F103Z.menu.opt.o3std.build.flags.optimize=-O3
genericSTM32F103Z.menu.opt.o3std.build.flags.ldspecs=
#genericSTM32F103Z.menu.opt.o3lto=Fastest (-O3) with LTO
#genericSTM32F103Z.menu.opt.o3lto.build.flags.optimize=-O3 -flto
#genericSTM32F103Z.menu.opt.o3lto.build.flags.ldspecs=-flto
genericSTM32F103Z.menu.opt.ogstd=Debug (-g)
genericSTM32F103Z.menu.opt.ogstd.build.flags.optimize=-Og
genericSTM32F103Z.menu.opt.ogstd.build.flags.ldspecs=


########################### STM32F100RB to FLASH ###########################

STM32F100RB.name=STM32F100RB to FLASH
#STM32F100RB.vid.0=0x1EAF
#STM32F100RB.pid.0=0x0004

STM32F100RB.build.vect=VECT_TAB_ADDR=0x8000000
STM32F100RB.build.core=maple
STM32F100RB.build.board=STM32F100RB
STM32F100RB.build.variant=STM32F100RB
STM32F100RB.build.ldscript=ld/jtag.ld

STM32F100RB.build.family=cortex-m3
STM32F100RB.build.f_cpu=24000000L
STM32F100RB.upload.use_1200bps_touch=false
STM32F100RB.upload.file_type=bin
STM32F100RB.upload.auto_reset=true
STM32F100RB.upload.params.quiet=no

STM32F100RB.build.cpu_flags=-DMCU_STM32F100RB

#---------------------------- UPLOAD METHODS ---------------------------

STM32F100RB.menu.upload_method.STLinkMethod=STLink
STM32F100RB.menu.upload_method.STLinkMethod.upload.protocol=STLink
STM32F100RB.menu.upload_method.STLinkMethod.upload.tool=stlink_upload
STM32F100RB.menu.upload_method.STLinkMethod.build.upload_flags=-DCONFIG_MAPLE_MINI_NO_DISABLE_DEBUG

#-- CPU Clock frequency
STM32F100RB.menu.cpu_speed.speed_72mhz=72Mhz (Normal)
STM32F100RB.menu.cpu_speed.speed_72mhz.build.f_cpu=72000000L

STM32F100RB.menu.cpu_speed.speed_48mhz=48Mhz (Slow - with USB)
STM32F100RB.menu.cpu_speed.speed_48mhz.build.f_cpu=48000000L

STM32F100RB.menu.cpu_speed.speed_128mhz=Overclocked 128Mhz NO USB SERIAL. MANUAL RESET NEEDED TO UPLOAD
STM32F100RB.menu.cpu_speed.speed_128mhz.build.f_cpu=128000000L

#-- Optimizations
STM32F100RB.menu.opt.osstd=Smallest (default)
#STM32F100RB.menu.opt.oslto=Smallest Code with LTO
#STM32F100RB.menu.opt.oslto.build.flags.optimize=-Os -flto
#STM32F100RB.menu.opt.oslto.build.flags.ldspecs=-flto
STM32F100RB.menu.opt.o1std=Fast (-O1)
STM32F100RB.menu.opt.o1std.build.flags.optimize=-O1
STM32F100RB.menu.opt.o1std.build.flags.ldspecs=
#STM32F100RB.menu.opt.o1lto=Fast (-O1) with LTO
#STM32F100RB.menu.opt.o1lto.build.flags.optimize=-O1 -flto
#STM32F100RB.menu.opt.o1lto.build.flags.ldspecs=-flto
STM32F100RB.menu.opt.o2std=Faster (-O2)
STM32F100RB.menu.opt.o2std.build.flags.optimize=-O2
STM32F100RB.menu.opt.o2std.build.flags.ldspecs=
#STM32F100RB.menu.opt.o2lto=Faster (-O2) with LTO
#STM32F100RB.menu.opt.o2lto.build.flags.optimize=-O2 -flto
#STM32F100RB.menu.opt.o2lto.build.flags.ldspecs=-flto
STM32F100RB.menu.opt.o3std=Fastest (-O3)
STM32F100RB.menu.opt.o3std.build.flags.optimize=-O3
STM32F100RB.menu.opt.o3std.build.flags.ldspecs=
#STM32F100RB.menu.opt.o3lto=Fastest (-O3) with LTO
#STM32F100RB.menu.opt.o3lto.build.flags.optimize=-O3 -flto
#STM32F100RB.menu.opt.o3lto.build.flags.ldspecs=-flto
STM32F100RB.menu.opt.ogstd=Debug (-g)
STM32F100RB.menu.opt.ogstd.build.flags.optimize=-Og
STM32F100RB.menu.opt.ogstd.build.flags.ldspecs=

################################################################################
